Revit 2026 API

# RebarHostDataGetRebarHostData Method

---

Gets a RebarHostData object referring to the specified rebar host element.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static RebarHostData GetRebarHostData(
	Element host
)
```
```vb
Public Shared Function GetRebarHostData (
	host As Element
) As RebarHostData
```
```cpp
public:
static RebarHostData^ GetRebarHostData(
	Element^ host
)
```
```fsharp
static member GetRebarHostData :
        host : Element -> RebarHostData
```

#### Parameters

host Element
     An element to host rebar.

#### Return Value

RebarHostData A RebarHostData object, or .

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Returns  for elements that cannot ever be rebar hosts, such as levels.

#### Reference

RebarHostData Class

Autodesk.Revit.DB.Structure Namespace